[
  {
    "Title": "Inception",
    "Description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
    "Image": "Inception.jpg",
    "Trailer_URL": "https://youtu.be/YoHD9XEInc0",
    "Year": 2010,
    "Age": "13+",
    "Directors": "Christopher Nolan",
    "Production": "Syncopy, Warner Bros.\n",
    "Genres": "Action,Adventure,Sci-Fi,Thriller",
    "Language": "English,Japanese,French",
    "Runtime": 148
  },
  {
    "Title": "The Matrix",
    "Description": "Neo (Keanu Reeves) believes that Morpheus (Laurence Fishburne), an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity (Carrie-Anne Moss), a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.",
    "Image": "thematrix.jpg",
    "Trailer_URL": "https://youtu.be/vKQi3bBA1y8",
    "Year": 1999,
    "Age": "18+",
    "Directors": "Andy Wachowski, Larry Wachowski",
    "Production": "Silver Pictures, Village Roadshow Prod.\n",
    "Genres": "Action,Sci-Fi",
    "Language": "English",
    "Runtime": 136
  },
  {
    "Title": "Avengers: Infinity War",
    "Description": "Iron Man, Thor, the Hulk and the rest of the Avengers unite to battle their most powerful enemy yet -- the evil Thanos. On a mission to collect all six Infinity Stones, Thanos plans to use the artifacts to inflict his twisted will on reality. The fate of the planet and existence itself has never been more uncertain as everything the Avengers have fought for has led up to this moment.",
    "Image": "infinitywar.jpg",
    "Trailer_URL": "https://youtu.be/6ZfuNTqbHE8",
    "Year": 2018,
    "Age": "13+",
    "Directors": "Anthony Russo,Joe Russo",
    "Production": "Marvel Studios",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Language": "English",
    "Runtime": 149
  },
   {
    "Title": "Avengers: Endgame",
    "Description": "Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.",
    "Image": "endgame.jpg",
    "Trailer_URL": "https://youtu.be/TcMBFSGVi1c",
    "Year": 2018,
    "Age": "13+",
    "Directors": "Anthony Russo,Joe Russo",
    "Production": "Marvel Studios, Walt Disney Pictures",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Language": "English",
    "Runtime": 149
  },
  {
    "Title": "The Incredible Hulk",
    "Description": "Scientist Bruce Banner (Edward Norton) desperately seeks a cure for the gamma radiation that contaminated his cells and turned him into The Hulk. Cut off from his true love Betty Ross (Liv Tyler) and forced to hide from his nemesis, Gen. Thunderbolt Ross (William Hurt), Banner soon comes face-to-face with a new threat: a supremely powerful enemy known as The Abomination (Tim Roth).",
    "Trailer_URL": "https://www.youtube.com/embed/xbqNb2PFKKA",
    "Year": 2008,
    "Directors": "Louis Leterrier",
    "Production": "Marvel Films, Valhalla Motion Pictures",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Runtime": 112
  },
  {
    "Title": "Captain America: The First Avenger",
    "Description": "It is 1941 and the world is in the throes of war. Steve Rogers (Chris Evans) wants to do his part and join America's armed forces, but the military rejects him because of his small stature. Finally, Steve gets his chance when he is accepted into an experimental program that turns him into a supersoldier called Captain America. Joining forces with Bucky Barnes (Sebastian Stan) and Peggy Carter (Hayley Atwell), Captain America leads the fight against the Nazi-backed HYDRA organization.",
    "Trailer_URL": "https://www.youtube.com/embed/JerVrbLldXw",
    "Year": 2011,
    "Directors": "Joe Johnston",
    "Production": "Marvel Enterprises",
    "Genres": "Action, Fantasy, Adventure",
    "Runtime": 124
  },
  {
    "Title": "Thor",
    "Description": "As the son of Odin (Anthony Hopkins), king of the Norse gods, Thor (Chris Hemsworth) will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki (Tom Hiddleston), Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.",
    "Trailer_URL": "https://www.youtube.com/embed/JOddp-nlNvQ",
    "Year": 2011,
    "Directors": "Kevin Fiege",
    "Production": "Marvel Studios",
    "Genres": "Action, Fantasy, Adventure",
    "Runtime": 113
  },
  {
    "Title": "Marvel's The Avengers",
    "Description": "When Thor's evil brother, Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D., initiates a superhero recruitment effort to defeat the unprecedented threat to Earth. Joining Fury's \"dream team\" are Iron Man (Robert Downey Jr.), Captain America (Chris Evans), the Hulk (Mark Ruffalo), Thor (Chris Hemsworth), the Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner).",
    "Trailer_URL": "https://www.youtube.com/embed/eOrNdBpGMv8",
    "Year": 2012,
    "Directors": "Joss Whedon",
    "Production": "Marvel Studios",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Runtime": 143
  },
  {
    "Title": "Iron Man",
    "Description": "A billionaire industrialist and genius inventor, Tony Stark (Robert Downey Jr.), is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.",
    "Trailer_URL": "https://www.youtube.com/embed/8hYlB38asDY",
    "Year": 2008,
    "Directors": "Jon Favreau",
    "Production": "Marvel Enterprises, Paramount",
    "Genres": "Action, Adventure, Sci Fi",
    "Runtime": 126
  },
  {
    "Title": "Iron Man 2",
    "Description": "With the world now aware that he is Iron Man, billionaire inventor Tony Stark (Robert Downey Jr.) faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts (Gwyneth Paltrow) and \"Rhodey\" Rhodes (Don Cheadle) by his side, Tony must forge new alliances and confront a powerful new enemy.",
    "Trailer_URL": "https://www.youtube.com/embed/BoohRoVA9WQ",
    "Year": 2015,
    "Directors": "Jon Favreau",
    "Production": "Marvel Studios",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Runtime": 124
  },
  {
    "Title": "Iron Man 3",
    "Description": "Plagued with worry and insomnia since saving New York from destruction, Tony Stark (Robert Downey Jr.), now, is more dependent on the suits that give him his Iron Man persona -- so much so that every aspect of his life is affected, including his relationship with Pepper (Gwyneth Paltrow). After a malevolent enemy known as the Mandarin (Ben Kingsley) reduces his personal world to rubble, Tony must rely solely on instinct and ingenuity to avenge his losses and protect the people he loves.",
    "Trailer_URL": "https://www.youtube.com/embed/8hYlB38asDY",
    "Year": 2013,
    "Directors": "Shane Black",
    "Production": "Marvel Studios",
    "Genres": "Sci Fi, Action, Fantasy, Adventure",
    "Runtime": 130
  }
]